case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  11
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;

writeControl    timeStep;
writeInterval   3000;
purgeWrite      1;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   8;
runTimeModifiable yes;

libs            ("libkOmegaSSTML.so");

functions {}

// ************************************************************************* //
