case_template/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  11
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType      RAS;

RAS
{
    RASModel        kOmegaSSTML;
    turbulence      on;
    printCoeffs     on;
}
