case_template/constant/transportProperties
FoamFile
{
    format  ascii;
    class   dictionary;
    object  transportProperties;
}
transportModel  Newtonian;
nu              7.0e-06;
