case_template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(0.001233722308 8.641293105e-08 0)
(0.001227419146 -4.715567032e-08 0)
(0.001228657462 6.875395437e-08 8.784790725e-28)
(0.00122047908 4.583950272e-08 -8.789788414e-28)
(0.001215369569 8.43303051e-08 3.301949281e-27)
(0.001205147922 1.045787838e-07 -6.245838319e-26)
(0.001193936361 1.205327121e-07 0)
(0.001180902863 1.409692473e-07 1.414833721e-27)
...
)
;

boundaryField
{
    bottomWall
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
