case_template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
4.592269562e-10
4.5278563e-10
4.506013895e-10
4.473290642e-10
4.440471379e-10
4.409061456e-10
4.37001191e-10
4.330059777e-10
...
)
;

boundaryField
{
    bottomWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           uniform 2.220446049e-16;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           uniform 2.220446049e-16;
    }
}


// ************************************************************************* //
