case_template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
140.0125646
140.0174331
140.0037289
139.9929372
139.9849462
139.9783175
139.9709974
139.9670807
...
)
;

boundaryField
{
    bottomWall
    {
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
99
(
560.0092797
560.7046208
562.1305688
564.9015701
568.3164803
567.8818329
566.1114677
563.8397609
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
99
(
140.0125646
140.0174331
140.0037289
139.9929372
139.9849462
139.9783175
139.9709974
139.9670807
...
)
;
    }
}


// ************************************************************************* //
