case_template/0/omegaSourceML
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  11
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omegaSourceML;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -2 0 0 0 0];

internalField   nonuniform List<scalar>
14751
(
0.00000000e+00
0.00000000e+00
0.00000000e+00
0.00000000e+00
0.00000000e+00
0.00000000e+00
0.00000000e+00
0.00000000e+00
...
)
;

boundaryField
{
    bottomWall { type zeroGradient; }
    topWall    { type zeroGradient; }
    inlet      { type cyclic; }
    outlet     { type cyclic; }
    defaultFaces { type empty; }
}

// *** //
