case_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  11
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors  0;
    consistent                yes;
    pRefCell                  0;
    pRefValue                 0;

    residualControl
    {
        p       1e-4;
        U       1e-4;
        k       1e-4;
        omega   1e-4;
    }
}

relaxationFactors
{
    fields      { p 0.15; }
    equations
    {
        U       0.3;
        k       0.15;
        omega   0.08;
    }
}

// ************************************************************************* //
